# Using Brew to Install


if OS.mac?
	# taps
	tap "homebrew/cask"
    	tap "homebrew/cask-fonts"	

	# Packages
	brew "trash" # rm, but put in the trash rather than completely delete

	# Applications
	cask "kitty" # a better terminal emulator
	cask "docker"
    	cask "keepassxc"
	cask "postman"
	cask "spotify"
	cask "min"

	#Fonts
	cask "font-fira-code"
    	cask "font-jetbrains-mono"
    	cask "font-cascadia-mono"
	cask "font-hack-nerd-font"
	cask "font-3270-nerd-font"

elsif OS.linux?
    	brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

# taps
tap "homebrew/bundle"
tap "homebrew/core"

#Packages
brew "calcurse"
brew "tmuxinator"
brew "yt-dlp" # Youtube MP4 Downloader
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "lazygit" # Terminal UI for git
brew "git-delta" # a better git diff
brew "entr" # file watcher / command runner
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "vim" # Vim (latest)
brew "wget" # internet file retriever
brew "htop" # a top alternative
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "python" # python (latest)
brew "zsh" # zsh (latest)
brew "z" # switch between most used directories	




